{
  "reviews": [
    {
      "slug": "2025-02-16",
      "headline": "Episode 1: Same Spirits, New Forms",
      "date": "Feb. 16, 2025",
      "image": "episode01.jpg",
      "post": [
        {
          "type": "text",
          "value": "Season 3 opens with the return of Belinda, the White Lotus Maui spa manager who is visiting the premier hotel chain’s Thailand location to learn new techniques from their wellness team. It’s great to see a familiar face, but also makes me curious whether Belinda will soon share the fate of Tanya, the show’s only other character to return for a second season. It didn't help that the opening scene quickly devolved into active gunfire with Belinda’s son, Zion, stumbling into an unidentified dead body. But answers aren’t coming any time soon. The show quickly snaps back in time to a week earlier, and will presumably run the course of the season filling in the events that precipitated this eventual shoot out. Thanks for the suspense, Mike White."
        },
        {
          "type": "text",
          "value": "The rest of this episode sets up the character dynamics that will dominate throughout the season. My first thought: there are a lot of storylines here."
        },
        {
          "type": "text",
          "value": "We have Rick, portrayed by Walter Goggins, who really nails the look of someone who just woke up, hungover, from an accidental nap on the beach. He’s jaded and sometimes looks like he’s crawling out of his skin, but it’s not quite obvious why. He seems very disappointed that Jim Hollinger, the husband of hotel owner Sritala, is not on-site at the resort this particular week. Rick is joined by his much-younger British girlfriend Chelsea, who is clearly going to be a fan favorite. I have absolutely loved Aimee Lou Wood since I first saw her in Sex Education, and I’m excited she landed such a big role. She’s optimistic, bright eyed, and way too good for Rick. I’m honestly hoping she leaves the White Lotus content and single — but who knows who will get out of this unscathed."
        },
        {
          "type": "text",
          "value": "Then we have the Ratliffs, a very WASPy family hailing from North Carolina. The father, Timothy, is a wealthy businessman who continuously receives calls from a journalist working on a story about illegal activity by his former business partner. It’s clear Mike White is precipitating an eventual fall from grace, but Timothy keeps the rest of his family in the dark. From the looks of it, they might not take the bad news so well. His wife, Victoria, played by Parker Posey already feels like the new Tonya to me. She’s ridiculous, dramatic, probably addicted to Lorasepam, and very out of touch with reality. She doesn’t seem like she’s planning to give up a life of luxury any time soon. Their adult children — Saxon, Piper, and Lochlan — are also an interesting bunch. There’s a strange, almost sexual undertone to their interactions, which makes me feel like things can’t be headed anywhere good, perhaps independent of the family’s precious financial situation. The middle daughter, Piper, is doing research for her thesis about a local Buddhist monk, while the eldest son, Saxon, is generally just dude-broing about and trying to get his gawky youngest brother, Lochlan, to follow suit."
        },
        {
          "type": "text",
          "value": "An important moment you might have missed: when Pam, who works at the resort, shows the family to their villa, she tells them not to eat the fruit that grows nearby, which is poisonous. Seems like a bit of a “Chekhov's Gun” to me. Maybe we won’t end the season with just one dead body this season."
        },
        {
          "type": "text",
          "value": "The episode also introduces us to a group of three childhood friends on a girl’s trip together: Jaclyn, a popular TV actress; Kate, an Austin transplant with that bob; and Laurie, a single mother and attorney who seems to be slightly out of step with the other two. But honestly, I get the sense that none of these women would have become friends had they met later in life. It’ll be interesting to see if they can resolve their differences, or if things will continue bubbling beneath the surface."
        },
        {
          "type": "text",
          "value": "This episode also introduces us to Gaitok, a security guard at the hotel, who flirts with Mook, another employee. Mook is played by LISA from BLACKPINK, which is honestly kind of insane. It’s her first major acting role, but I’m curious to see if her character becomes particularly important because the actress herself is so famous. Hopefully she has a little more character development than just being Gaitok’s crush."
        },
        {
          "type": "text",
          "value": "The real plot twist in this episode comes after Rick leaves Chelsea to drink alone — I really don’t like him already — and she befriends Chloe, a French-Canadian ex-model who lives near the White Lotus with her boyfriend and hangs out around the hotel bar. It’s revealed that Chloe’s boyfriend, “Gary,” is actually Greg Hunt, Tanya’s widower (who is, of course, culpable in her death). It’s crazy to see him back, but I have a lot of questions. Why would he change his name to something so similar? Why would he “hide out” at another White Lotus location after his wife disappeared from the one in Sicily? And is that the actor that played uncle Rico in Napoleon Dynamite? I just figured that out, haha."
        },
        {
          "type": "text",
          "value": "There are some potential plot holes, but there’s also a lot of drama that is set up in this episode, and I’m very excited to see how it unfolds. I’d give this episode a 9.5/10. The plot seems great so far, but I’m EXTREMELY bummed that the theme song is so tame. A real step down from last season, unfortunately. I might be skipping past the intro next week."
        }
      ]
    },
    {
      "slug": "2025-02-23",
      "headline": "Episode 2: Special Treatments",
      "date": "Feb. 23, 2025",
      "image": "episode02.jpg",
      "post": [
        {
          "type": "text",
          "value": "This episode ran a little tamer than I expected. It feels like we’re still in the midst of the set-up part of the plot, waiting to learn more about each of these characters. I’m still enjoying seeing their character development, but I’m hoping this isn’t too slow of a burn."
        },
        {
          "type": "text",
          "value": "As predicted, tensions are building within the group of girl friends. Jaclyn and Kate are trash-talking Laurie, and Laurie and Kate are trash-talking Jaclyn. I wonder who will be on the outs next… It may not come as much of a surprise, but I will say that I think the scripting is just perfect — delivered by hushed voices behind fake smiles. Their interactions feel very real to me, like I know these women. I can’t quite tell who to feel sorry for. At first, I thought Laurie was a clear punching bag, but now I’m not so sure. She’s a bit of a hater in a way that just doesn’t sit right with me. There’s not a definitive answer to which is worse between kicking someone while they’re down or resenting someone while they’re up. It’s all disappointing."
        },
        {
          "type": "text",
          "value": "I think we start to get more of a sense of where Mike White is going in this session during Rick’s mediation session with Amrita, who works at the White Lotus. He opens up about his traumatic childhood, and she encourages him to look inward. He doesn’t seem to quite take to these lessons in the way he probably needs to, which I could imagine might be his undoing later on. Wellness is clearly a thread throughout this season, but many of these characters don’t seem interested in taking the proper steps to attain that wellness. It takes more than booking an expensive vacation and a massage."
        },
        {
          "type": "text",
          "value": "One of the biggest climaxes of this episode is when two men rob the hotel boutique, and Chelsea is almost caught in the cross-fire. Rick seems completely inept at comforting her, which just reaffirms how one-sided I feel their relationship is. Chelsea takes it like a champ, but she deserves so much better. Rick even tells Chelsea he’s leaving for Bangkok to track down Sritala’s husband, turning a moment that should be about comforting her into a further descent into his own pain."
        },
        {
          "type": "text",
          "value": "Things also remain tense with the Ratliffs as Timothy’s phone continues blowing up, Saxon makes crude comments about Piper’s sex life, and Victoria is simply sticking out like a sore thumb. I’m living for her because her accent is hilarious, but she definitely doesn’t seem like she’s learning any lessons this season. I’m curious to see if everything will fall apart for Timothy during the trip, or if he’ll manage to fend off reporters and allegations until the end of their stay."
        },
        {
          "type": "text",
          "value": "What I’m most excited about in the next episode is learning more about Greg-Gary, especially after Belinda clocks him. Is she going to realize he killed Tonya? What will she do? I’m dying to know. Hopefully we're not in suspense much longer, but I wouldn’t be surprised if we were."
        },
        {
          "type": "text",
          "value": "I’d give this episode a 7/10. I’m still on the hook, but am curious to see if things are going to pick up with the staff at the resort, what Rick is planning, what’s happening with Greg-Gary, etcetera. We’re going to need some more kernels to that effect next week!"
        }
      ]
    }
  ]
}
